{
    "Apple___Apple_scab": "Use a fungicide to control scab. Keep the orchard clean by removing infected leaves and fruit.",
    "Apple___Black_rot": "Use a fungicide to control black rot. Remove infected fruit and cankers from the trees.",
    "Apple___Cedar_apple_rust": "Use a fungicide to control cedar apple rust. Remove infected leaves and fruit.",
    "Apple___healthy": "Keep the orchard clean and healthy by removing fallen leaves and fruit.",
    "Blueberry___healthy": "Keep the blueberry bushes healthy by providing proper water, fertilizer, and sunlight.",
    "Cherry_(including_sour)___Powdery_mildew": "Use a fungicide to control powdery mildew. Provide good air circulation and avoid overhead watering.",
    "Cherry_(including_sour)___healthy": "Keep the cherry trees healthy by providing proper water, fertilizer, and sunlight.",
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Use a fungicide to control leaf spot and gray leaf spot. Rotate crops and avoid overhead watering.",
    "Corn_(maize)___Common_rust_": "Use a fungicide to control common rust. Rotate crops and avoid overhead watering.",
    "Corn_(maize)___Northern_Leaf_Blight": "Use a fungicide to control northern leaf blight. Rotate crops and avoid overhead watering.",
    "Corn_(maize)___healthy": "Keep the corn healthy by providing proper water, fertilizer, and sunlight.",
    "Grape___Black_rot": "Use a fungicide to control black rot. Remove infected grapes and canes.",
    "Grape___Esca_(Black_Measles)": "There is no cure for Esca. Remove infected vines and avoid wounding the vines.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Use a fungicide to control leaf blight. Remove infected leaves.",
    "Grape___healthy": "Keep the grapes healthy by providing proper water, fertilizer, and sunlight.",
    "Orange___Haunglongbing_(Citrus_greening)": "There is no cure for Haunglongbing. Remove infected trees and control the Asian citrus psyllid.",
    "Peach___Bacterial_spot": "Use a bactericide to control bacterial spot. Remove infected fruit and leaves.",
    "Peach___healthy": "Keep the peach trees healthy by providing proper water, fertilizer, and sunlight.",
    "Pepper,_bell___Bacterial_spot": "Use a bactericide to control bacterial spot. Remove infected fruit and leaves.",
    "Pepper,_bell___healthy": "Keep the pepper plants healthy by providing proper water, fertilizer, and sunlight.",
    "Potato___Early_blight": "Use a fungicide to control early blight. Rotate crops and remove infected tubers.",
    "Potato___Late_blight": "Use a fungicide to control late blight. Rotate crops and remove infected tubers.",
    "Potato___healthy": "Keep the potato plants healthy by providing proper water, fertilizer, and sunlight.",
    "Raspberry___healthy": "Keep the raspberry plants healthy by providing proper water, fertilizer, and sunlight.",
    "Soybean___healthy": "Keep the soybean plants healthy by providing proper water, fertilizer, and sunlight.",
    "Squash___Powdery_mildew": "Use a fungicide to control powdery mildew. Provide good air circulation and avoid overhead watering.",
    "Strawberry___Leaf_scorch": "Use a fungicide to control leaf scorch. Remove infected leaves and provide proper water and fertilizer.",
    "Strawberry___healthy": "Keep the strawberry plants healthy by providing proper water, fertilizer, and sunlight.",
    "Tomato___Bacterial_spot": "Use a bactericide to control bacterial spot. Remove infected fruit and leaves.",
    "Tomato___Early_blight": "Use a fungicide to control early blight. Rotate crops and remove infected fruit and leaves.",
    "Tomato___Late_blight": "Use a fungicide to control late blight. Rotate crops and remove infected fruit and leaves.",
    "Tomato___Leaf_Mold": "Use a fungicide to control leaf mold. Provide good air circulation and remove infected leaves.",
    "Tomato___Septoria_leaf_spot": "Use a fungicide to control septoria leaf spot. Rotate crops and remove infected leaves.",
    "Tomato___Spider_mites Two-spotted_spider_mite": "Use a miticide to control spider mites. Provide good air circulation and remove infected leaves.",
    "Tomato___Target_Spot": "Use a fungicide to control target spot. Rotate crops and remove infected fruit and leaves.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "There is no cure for tomato yellow leaf curl virus. Remove infected plants and control whiteflies.",
    "Tomato___Tomato_mosaic_virus": "There is no cure for tomato mosaic virus. Remove infected plants and control aphids.",
    "Tomato___healthy": "Keep the tomato plants healthy by providing proper water, fertilizer, and sunlight."
}